/*                   Для_Практичних   22222                     */
// Задача. Дано масив років народження працівників. Вивести тих, які народилися між 1980 і 2003 роками.

// let arr = [1990, 2005, 2002, 1980, 2000, 2001];

// let arr2 = arr.filter((v, i, arr) => v >= 1980 && v <= 2003);
// document.write(arr2);

//-----------------------------------------------------------
// Задача. Дано масив показників термометра протягом місяця. З’ясувати, чи усі показники є більшими за 10 градусів.

// let temp = [17,28,34,-10,-4,-2,8,15,12]
// let temp10 = temp.every((v,i,arr)=>v>10)
// document.write(temp10)

//-----------------------------------------------------------
// Задача. Знайти добуток від’ємних елементів масиву.

// let array = [17, 28, 34, -10, -4, -2, 8, 15, 12];
// function gett(res, val) {
//   if (val < 0) {
//     res *= val;
//   }
//   return res;
// }
// let newArr = array.reduce(gett,1);
// document.write(newArr);

//-----------------------------------------------------------

// Задача. Знайти суму від’ємних елементів масиву.

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];
// function getSum(res, val) {
//   if (val < 0) {
//     res += val;
//   }
//   return res;
// }
// let arr2 = arr.reduce(getSum, 0);
// document.write(arr2)

//-----------------------------------------------------------

// Задача. Створити функцію, яка б могла знаходити суму для довільної кількості переданих чисел

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];

// function getSum(a, b) {
//   return (a += b);   <-- тут краще просто повертати суму  return a + b;
// }
// let c = arr.reduce(getSum, 0);
// document.write(c)

//-----------------------------------------------------------

// Задача. Знайти або суму, або добуток чисел.

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];

// function getSum(result, b) {
//   return (result += b);    <-- зауваження аналогічне до попереднього
// }
// function getMult(result, b) {
//    return result*=b
// }
// let mult = arr.reduce(getMult, 1)
// document.write(mult + '<br>')

// let sum = arr.reduce(getSum, 0);
// document.write(sum)

//-----------------------------------------------------------
//TODO  доробити
// Задача. Дано масив цілих чисел. Вибрати одну із дій при перегляді елементів.
// Якщо елемент більше за заданий то:
// 1)помножити на 2;
// 2)поділити на 7;
// Якщо елемент менше рівне за заданий то:
// 1)помножити на 3;
// 2)помножити на 5.

//-----------------------------------------------------------
// Задача 1. Дано одновимірний масив. Кожен елемент
// 1)піднести до квадрату;
// 2)помножити на 7;
// 3)поділити на 10.

// let arr = [17, 28, 34, 10, 4, 2, 8, 15, 12];

// let square = arr.map((val,i,arr) => Math.pow(arr[i], 2))
// document.write(square+'<br>')

// let mult7 = arr.map((val,i,arr)=>arr[i]*=7)
// document.write(mult7+'<br>')

// let divis = arr.map((val, i, arr) => arr[i] /= 10)
// document.write(divis+'<br>')

//-----------------------------------------------------------
/*                        ДЗ_1                                   */

// Задача 1. Дано масив цілих чисел. Кожне від’ємне число замінити на 0.

// let arr = [17, -28, 34, -10, -4, 2, 8, -15, 12];
// arr.forEach((val,i,arr) => {
//    if(val<0) return arr[i]=0      <-- не потрібен return
// })
// document.write(arr)

//-----------------------------------------------------------

// Задача 2. Дано масив цін. Сформувати новий масив, який містить тільки ті ціни, які менші за задану.

// let prices = [1000,90,10,200,450,650,7,30,5000]
// let newPrice = prices.filter((val,i,arr)=>arr[i]<500)
// document.write(newPrice)

//-----------------------------------------------------------

// Задача 3. Дано масив цін товарів. Для цін, які менші за 1000грн. додати 20% ціни, для тих, які більші за 1000 грн. відняти 30%.

// let prices = [1500,90,10,200,450,650,7,30,5000]
// prices.forEach((val, i, arr) => {
//    if(val<1000) arr[i]*=1.2   <-- тут треба використатит else
//    if(val>1000) arr[i]*=0.7
// })
// document.write(prices)

//-----------------------------------------------------------

// Задача 4. Дано масив імен. Сформувати новий масив, який складається з імен, які починаються на задану літеру.

// let names = ['Anna','Inna','Ivan','Igor','Anton']
// let newNames = names.filter((val, i, arr) => {
//    namesToUp=val.toUpperCase()
//    if(namesToUp[0]==="I") return val
// })
// document.write(newNames)

//-----------------------------------------------------------

// Задача 5. Дано ваги автомобілів на парковці. З’ясувати, чи усі автомобілі є легковими (легшими за 2000 кг).

// let carsWeight = [3500,4000,1500,1250,10000,3200]
// if (carsWeight.every((val, i, arr) => val < 2000)) {
//    document.write('Всі легкові')
// } else {
//    document.write('Є вантажні(більші за 2000кг)')
// }

//-----------------------------------------------------------

// Задача 6. Дано масив, який зберігає кількість відвідувачів протягом тижня. З’ясувати, чи були дні, коли кількість відвідувачів була меншою за 10.

// let costumers = [15,20,13,56,34,51,9,5,8,11]
// if (costumers.some((val, i, arr) => val < 10)) {
//    document.write('Були')
// } else {
//    document.write('Не було')
// }

//-----------------------------------------------------------

// Задача 7. Розробити функцію, яка би для довільної кількості переданих символів визначала, кількість букв «а».

// let letters = ['b', 'c', 'a', 's', 'a', 'x', 'a', 'z', 'a', 'a', 'w', 'a']
// let c = letters.filter((val) => {        <-- треба би reduce
//    let x = val.toUpperCase()
//    return x==='A'
// })
// console.log(c);

//-----------------------------------------------------------

// Задача 8. Розробити функцію, яка би для довільної кількості чисел знаходила добуток чисел.

// let numbers = [123,42,77,32,90]
// function getMult(a, b) {
//    return a*=b
// }
// document.write(numbers.reduce(getMult,1))

//-----------------------------------------------------------

// Задача 9. Розробити функцію, яка би для довільної кількості чисел знаходила максимальне.
// let numbers = [12,42,770,32,90]

// let c = numbers.reduce((prev, val) => {
//    if (prev < val) {
//       return val
//    } else {
//       return prev
//    }
// }, numbers[0])   <-- можна цього не писати, воно таке за замовлчуванням
// document.write(c)

// другий спосіб

// numbers.sort((a, b,) => (b - a))
// document.write(`${numbers[0]}`)

//-----------------------------------------------------------

/*                   ДЗ_2                   */

//-----------------------------------------------------------
//TODO Найшов розв'язок в інтернеті
// 1.	Задача. Відсортувати масив імен за останньою літерою.

// let names = ["Anna", "Inna", "Ivan", "Igor", "Anton", "Andriy"];

//               1 спосіб
// names.sort(function(a, b){
//     var lastA = a.charAt(a.length - 1);
//     var lastB = b.charAt(b.length - 1);
//     if (lastA > lastB) {
//         return 1;
//     } else if (lastA < lastB) {
//         return -1;
//     } else {
//         return 0;
//     }
// });
// console.log(names);

//               2 спосіб

// function last(x) {
//    return x.sort((a, b) => a.charCodeAt(a.length - 1) - b.charCodeAt(b.length - 1));
// }
// console.log(last(names));

//-----------------------------------------------------------

// 2.	Задача. Дано масив цін. Для усіх товарів, які дорожчі за 1000грн дати знижку 20% (помножити на 0.8), а для усіх інших товарів – надати 5 % знижки (помножити на 0.95).

// let prices = [1500,90,10,200,450,650,70,30,5000]

// prices.forEach((val,i,arr) => {
//    if (val >= 1000) return arr[i] *= 0.8   <-- Використати else
//    if(val < 1000) return arr[i]*=0.95
// })

// document.write(prices)

//-----------------------------------------------------------

// 3.	Задача. Дано масив років народження працівників. Вивести масив тих, які є призовного віку (менше 25 років).

// let arr = [1990, 2005, 2002, 1980, 2000, 2001];

// let c = arr.filter((val, i, arr) => {
//   if (val >= 1996) return arr[i];    <-- краще повертати логічний вираз (просто повернути умову, як у наступному завданні)
// });
// console.log(c);

//-----------------------------------------------------------

// 4.	Задача. Дано масив показників гемоглобіну (масив чисел). Сформувати масив тих, які є меншими за 115.

// let gemoglobine = [75,120,131,56,34,51,119,155,128,111]

// let newArr = gemoglobine.filter((val)=>val<115)
// console.log(newArr);

//-----------------------------------------------------------

// 5.	Задача. Дано масив цін товарів. Сформувати масив тих, які є меншими за 2000грн.

// let prices = [1500, 90, 10, 2001, 450, 650, 70, 30, 5000]
// let newPrices = prices.filter((val)=>val<2000)
// console.log(newPrices);

//-----------------------------------------------------------

// 6.	Задача. Дано масив цін товарів. Знайти сумарну вартість тих, які знаходяться в межах від 1000 до 2000.

// let prices = [1500, 1190, 1110, 2001, 1450, 1650, 70, 30, 5000];

// let c = prices.filter((val) => {
//   if (val >= 1000 && val <= 2000) return val;    <-- повернути умову
// });
// console.log(c);

// function getSum(a,b) {
//   return a+=b
// }
// console.log(c.reduce(getSum,0));

//-----------------------------------------------------------

// 7.	Задача. Дано масив номерів автомобілів. Сформувати масив тих, які починаються на літеру «А» і закінчуються на літеру «Р».

// let carNum = ["AO 3333 AP", "AC 2233 BC", "AO 1516 BP"];
// let newNum = carNum.filter((val, i, arr) => {
//    // if(arr[0][0] === 'A' && arr[0][arr.length-1] === 'P') return arr[i]// TODO чому такий запис не працює?
//   if (val[0] === "A" && val[val.length - 1] === "P") return val;    <-- повернути умову
// });
// console.log(newNum);

//-----------------------------------------------------------

// 8.	Задача. Дано масив літер. Сформувати рядок, який складається тільки з голосних літер.

let letters = [
  "а",
  "о",
  "к",
  "е",
  "ц",
  "и",
  "т",
  "н",
  "с",
  "і",
  "з",
  "п",
  "у",
  "р",
  "л",
];

let newArr = letters.filter((val) => {
  let upLetter = val.toUpperCase();
  if (
    upLetter === "А" ||
    upLetter === "О" ||
    upLetter === "Е" ||
    upLetter === "И" ||
    upLetter === "У" ||
    upLetter === "І"
  )
    return val
});
document.write(newArr);
