/*                   Для_Практичних                         */
// Задача. Дано масив років народження працівників. Вивести тих, які народилися між 1980 і 2003 роками.

// let arr = [1990, 2005, 2002, 1980, 2000, 2001];

// let arr2 = arr.filter((v, i, arr) => v >= 1980 && v <= 2003);
// document.write(arr2);

//-----------------------------------------------------------
// Задача. Дано масив показників термометра протягом місяця. З’ясувати, чи усі показники є більшими за 10 градусів.

// let temp = [17,28,34,-10,-4,-2,8,15,12]
// let temp10 = temp.every((v,i,arr)=>v>10)
// document.write(temp10)

//-----------------------------------------------------------
// Задача. Знайти добуток від’ємних елементів масиву.

// let array = [17, 28, 34, -10, -4, -2, 8, 15, 12];
// function gett(res, val) {
//   if (val < 0) {
//     res *= val;
//   }
//   return res;
// }
// let newArr = array.reduce(gett,1);
// document.write(newArr);

//-----------------------------------------------------------

// Задача. Знайти суму від’ємних елементів масиву.

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];
// function getSum(res, val) {
//   if (val < 0) {
//     res += val;
//   }
//   return res;
// }
// let arr2 = arr.reduce(getSum, 0);
// document.write(arr2)

//-----------------------------------------------------------

// Задача. Створити функцію, яка б могла знаходити суму для довільної кількості переданих чисел

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];

// function getSum(a, b) {
//   return (a += b);
// }
// let c = arr.reduce(getSum, 0);
// document.write(c)

//-----------------------------------------------------------

// Задача. Знайти або суму, або добуток чисел.

// let arr = [17, 28, 34, -10, -4, -2, 8, 15, 12];

// function getSum(result, b) {
//   return (result += b);
// }
// function getMult(result, b) {
//    return result*=b
// }
// let mult = arr.reduce(getMult, 1)
// document.write(mult + '<br>')

// let sum = arr.reduce(getSum, 0);
// document.write(sum)

//-----------------------------------------------------------
//TODO  доробити
// Задача. Дано масив цілих чисел. Вибрати одну із дій при перегляді елементів. 
// Якщо елемент більше за заданий то:
// 1)помножити на 2;
// 2)поділити на 7;
// Якщо елемент менше рівне за заданий то:
// 1)помножити на 3;
// 2)помножити на 5.

//-----------------------------------------------------------
// Задача 1. Дано одновимірний масив. Кожен елемент
// 1)піднести до квадрату;
// 2)помножити на 7;
// 3)поділити на 10.

// let arr = [17, 28, 34, 10, 4, 2, 8, 15, 12];

// let square = arr.map((val,i,arr) => Math.pow(arr[i], 2))
// document.write(square+'<br>')

// let mult7 = arr.map((val,i,arr)=>arr[i]*=7)
// document.write(mult7+'<br>')

// let divis = arr.map((val, i, arr) => arr[i] /= 10)
// document.write(divis+'<br>')

//-----------------------------------------------------------
/*                        ДЗ_1                                   */

// Задача 1. Дано масив цілих чисел. Кожне від’ємне число замінити на 0.

// let arr = [17, -28, 34, -10, -4, 2, 8, -15, 12];
// arr.forEach((val,i,arr) => {
//    if(val<0) return arr[i]=0
// })
// document.write(arr)

//-----------------------------------------------------------

// Задача 2. Дано масив цін. Сформувати новий масив, який містить тільки ті ціни, які менші за задану.

// let prices = [1000,90,10,200,450,650,7,30,5000]
// let newPrice = prices.filter((val,i,arr)=>arr[i]<500)
// document.write(newPrice)

//-----------------------------------------------------------

// Задача 3. Дано масив цін товарів. Для цін, які менші за 1000грн. додати 20% ціни, для тих, які більші за 1000 грн. відняти 30%.

// let prices = [1500,90,10,200,450,650,7,30,5000]
// prices.forEach((val, i, arr) => {
//    if(val<1000) arr[i]*=1.2
//    if(val>1000) arr[i]*=0.7
// })
// document.write(prices)

//-----------------------------------------------------------

// Задача 4. Дано масив імен. Сформувати новий масив, який складається з імен, які починаються на задану літеру.

// let names = ['Anna','Inna','Ivan','Igor','Anton']
// let newNames = names.filter((val, i, arr) => {
//    namesToUp=val.toUpperCase()
//    if(namesToUp[0]==="I") return val
// })
// document.write(newNames)

//-----------------------------------------------------------

// Задача 5. Дано ваги автомобілів на парковці. З’ясувати, чи усі автомобілі є легковими (легшими за 2000 кг).

// let carsWeight = [3500,4000,1500,1250,10000,3200]
// if (carsWeight.every((val, i, arr) => val < 2000)) {
//    document.write('Всі легкові')
// } else {
//    document.write('Є вантажні(більші за 2000кг)')
// }

//-----------------------------------------------------------
